Subject [PDF](https://cdn.intra.42.fr/pdf/pdf/67635/en.subject.pdf) 

# SSH

```b
$ ifconfig
$ ifconfig | grep inet
$ ifconfig | grep 'inet ' | awk 'NR==2'
$ ssh level00@$(ifconfig | grep 'inet ' | awk 'NR==2 {print $2}') -p 4242
```

# 00

First thought
- the folder is empty
- who am i: level00

What permissions do i have?
- `ls -ld` 
  - use `-d` to see info about the current folder (not its list) 
- `level00 level00` 
  - I am level00. I am the owner. I am the group.
- `dr-xr-x---+` 
  - owner (me) and group members (my group) can `read/exec` (not write) 
```b
level00@SnowCrash:~$ ls -l
total 0
level00@SnowCrash:~$ ls -ld
dr-xr-x---+ 1 level00 level00 100 Mar  5  2016 .
```

My permissions:
- I own this folder, but i can't vi/rm/mv/touch its contents.
- can be proved by other commands as well:
  - `namei -l $(pwd)`
  - `getfacl .` (ACL: Access Control Lists)

Special folder: __`/tmp`__:
- the `/tmp` is conventionally "world-writable"
```b
> ls -ld /tmp
d-wx-wx-wx 4 root root 80 Nov 19 19:58 /tmp
  ^^ ^^ ðŸ”µ writable/executable
```
- i can w|x but not list files, no one can

Learn the __Echo-Chmod Combo__, eg.
- `echo "something" > /tmp/go.sh && chmod +x /tmp/go.sh && sh /tmp/go.sh`
- it's a famous trick

Special folder: __`/etc`__:
- `etc` here is `rwxr-x`
```b
> ls -ld /etc
drwxr-xr-x 1 root root 260 Nov 19 18:30 /etc
```
- ie. we can `ls/cat` it and its contents
```b
> ls -l /etc
(omitted outputs)
> cat /etc/passwd
...
flag01:42hDRfypTqqnw:3001:3001::/home/flag/flag01:/bin/bash
...
```
- ðŸ‘† accidentally got `flag01`

Check if there are more special files \
We look for any file owned __1) by me, 2) by the account I try to log in__
- `/` : from root directory
- `\;` : ends `-exec` and `cat` one file a time
- `+` : now `find` runs `cat` on several files at once 
- `2>/dev/null` : no error msg explosion (sending stderr output to `/dev/null`)

```b
> find / -user level00 
> find / -user level00 2>/dev/null
> find / -user flag00 2>/dev/null
> find / -user flag00 -exec cat {} \; 2>/dev/null
OR
> find / -user flag00 -exec cat {} + 2>/dev/null
cdiiddwpgswtgt
cdiiddwpgswtgt
```
- ðŸ‘† we have a cipher


Decipher _`cdiiddwpgswtgt`_ in python

```sh
a = ord('a')
for i in range(26):
    print(''.join(chr(a+(ord(c)-a+i)%26) for c in 'cdiiddwpgswtgt'))
```

